app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["user_id", 1], ["created_at", 2016-09-25 23:36:49 UTC], ["updated_at", 2016-09-25 23:36:49 UTC], ["picture", "Screen_Shot_2016-09-22_at_9.16.15_AM.png"]]